; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain mailrun)
    (:types
        hamlet scroll satchel courier - object
    )
    (:predicates
        (posted-at ?b - courier ?x - hamlet)
        (resting ?i - scroll ?x - hamlet)
        (road ?x - hamlet ?y - hamlet)
        (idle ?a - satchel)
        (held-in ?i - scroll ?a - satchel)
        (stowed-in ?i - scroll ?b - courier)
        (attached ?a - satchel ?b - courier)
    )

    (:functions
        (pouch_limit ?b - courier)
        (current_pouch ?b - courier)
        (mass ?i - scroll)
        (toll)
    )

    (:action ride
        :parameters (?b - courier ?x - hamlet ?y - hamlet)
        :precondition (and (posted-at ?b ?x)
            (road ?x ?y))
        :effect (and (posted-at ?b ?y)
            (not (posted-at ?b ?x))
            (increase (toll) 3)
        )
    )

    (:action grab
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (resting ?i ?x) (posted-at ?b ?x) (idle ?a) (attached ?a ?b)
            (<= (+ (current_pouch ?b) (mass ?i)) (pouch_limit ?b)))
        :effect (and (held-in ?i ?a)
            (not (resting ?i ?x))
            (not (idle ?a))
            (increase (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action place
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (posted-at ?b ?x)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (resting ?i ?x)
            (not (held-in ?i ?a))
            (decrease (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action to-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (not (held-in ?i ?a))
            (stowed-in ?i ?b)
            (increase (toll) 1)
        )
    )

    (:action from-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (stowed-in ?i ?b)
            (attached ?a ?b)
            (idle ?a))
        :effect (and (not (idle ?a))
            (held-in ?i ?a)
            (not (stowed-in ?i ?b))
            (increase (toll) 1)
        )
    )
)

; problem
(define (problem mailrun-p03)
   (:domain mailrun)
   (:objects hamleta hamletb hamletc - hamlet
             scroll8 scroll7 scroll6 scroll5 scroll4 scroll3 scroll2 scroll1 - scroll
             courier1 courier2 - courier
             leftstrap1 rightstrap1 leftstrap2 rightstrap2 - satchel)
   (:init (= (mass scroll8) 2)
          (= (mass scroll7) 2)
          (= (mass scroll6) 1)
          (= (mass scroll5) 1)
          (= (mass scroll4) 2)
          (= (mass scroll3) 2)
          (= (mass scroll2) 1)
          (= (mass scroll1) 1)
          (resting scroll8 hamleta)
          (resting scroll7 hamleta)
          (resting scroll6 hamleta)
          (resting scroll5 hamleta)
          (resting scroll4 hamleta)
          (resting scroll3 hamleta)
          (resting scroll2 hamleta)
          (resting scroll1 hamleta)

          (posted-at courier1 hamleta)
          (posted-at courier2 hamleta)
          (idle leftstrap1)
          (idle rightstrap1)
          (idle leftstrap2)
          (idle rightstrap2)
          (attached leftstrap1 courier1)
          (attached rightstrap1 courier1)
          (attached leftstrap2 courier2)
          (attached rightstrap2 courier2)

          (road hamleta hamletb)
          (road hamletb hamleta)
          (road hamleta hamletc)
          (road hamletc hamleta)

          (= (current_pouch courier1) 0)
          (= (pouch_limit courier1) 4)
          (= (current_pouch courier2) 0)
          (= (pouch_limit courier2) 4)
          (= (toll) 0))

   (:goal (and (resting scroll8 hamletb)
               (resting scroll7 hamletb)
               (resting scroll6 hamletb)
               (resting scroll5 hamletb)
               (resting scroll4 hamletc)
               (resting scroll3 hamletc)
               (resting scroll2 hamletc)
               (resting scroll1 hamletc)))

   (:metric minimize (toll))
)

; plan
1. (grab scroll4 hamleta leftstrap2 courier2)
   deleted: (resting scroll4 hamleta) (idle leftstrap2)
   added: (held-in scroll4 leftstrap2)
   changed: (current_pouch courier2) from 0 to 2, (toll) from 0 to 2
   goals met: 0 of 8
2. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 2 to 5
   goals met: 0 of 8
3. (grab scroll5 hamleta rightstrap1 courier1)
   deleted: (resting scroll5 hamleta) (idle rightstrap1)
   added: (held-in scroll5 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 5 to 7
   goals met: 0 of 8
4. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 7 to 10
   goals met: 0 of 8
5. (place scroll5 hamletb rightstrap1 courier1)
   deleted: (held-in scroll5 rightstrap1)
   added: (idle rightstrap1) (resting scroll5 hamletb)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 10 to 12
   goals met: 1 of 8
6. (place scroll4 hamletc leftstrap2 courier2)
   deleted: (held-in scroll4 leftstrap2)
   added: (idle leftstrap2) (resting scroll4 hamletc)
   changed: (current_pouch courier2) from 2 to 0, (toll) from 12 to 14
   goals met: 2 of 8
7. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 14 to 17
   goals met: 2 of 8
8. (grab scroll1 hamleta rightstrap2 courier2)
   deleted: (resting scroll1 hamleta) (idle rightstrap2)
   added: (held-in scroll1 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 17 to 19
   goals met: 2 of 8
9. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 19 to 22
   goals met: 2 of 8
10. (place scroll1 hamletc rightstrap2 courier2)
   deleted: (held-in scroll1 rightstrap2)
   added: (idle rightstrap2) (resting scroll1 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 22 to 24
   goals met: 3 of 8
11. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 24 to 27
   goals met: 3 of 8
12. (grab scroll6 hamleta rightstrap2 courier2)
   deleted: (resting scroll6 hamleta) (idle rightstrap2)
   added: (held-in scroll6 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 27 to 29
   goals met: 3 of 8
13. (grab scroll2 hamleta leftstrap2 courier2)
   deleted: (resting scroll2 hamleta) (idle leftstrap2)
   added: (held-in scroll2 leftstrap2)
   changed: (current_pouch courier2) from 1 to 2, (toll) from 29 to 31
   goals met: 3 of 8
14. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 31 to 34
   goals met: 3 of 8
15. (grab scroll7 hamleta rightstrap1 courier1)
   deleted: (resting scroll7 hamleta) (idle rightstrap1)
   added: (held-in scroll7 rightstrap1)
   changed: (current_pouch courier1) from 0 to 2, (toll) from 34 to 36
   goals met: 3 of 8
16. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 36 to 39
   goals met: 3 of 8
17. (place scroll7 hamletb rightstrap1 courier1)
   deleted: (held-in scroll7 rightstrap1)
   added: (idle rightstrap1) (resting scroll7 hamletb)
   changed: (current_pouch courier1) from 2 to 0, (toll) from 39 to 41
   goals met: 4 of 8
18. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 41 to 44
   goals met: 4 of 8
19. (grab scroll8 hamleta rightstrap1 courier1)
   deleted: (resting scroll8 hamleta) (idle rightstrap1)
   added: (held-in scroll8 rightstrap1)
   changed: (current_pouch courier1) from 0 to 2, (toll) from 44 to 46
   goals met: 4 of 8
20. (ride courier1 hamleta hamletb)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletb)
   changed: (toll) from 46 to 49
   goals met: 4 of 8
21. (place scroll8 hamletb rightstrap1 courier1)
   deleted: (held-in scroll8 rightstrap1)
   added: (idle rightstrap1) (resting scroll8 hamletb)
   changed: (current_pouch courier1) from 2 to 0, (toll) from 49 to 51
   goals met: 5 of 8
22. (ride courier1 hamletb hamleta)
   deleted: (posted-at courier1 hamletb)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 51 to 54
   goals met: 5 of 8
23. (grab scroll3 hamleta rightstrap1 courier1)
   deleted: (resting scroll3 hamleta) (idle rightstrap1)
   added: (held-in scroll3 rightstrap1)
   changed: (current_pouch courier1) from 0 to 2, (toll) from 54 to 56
   goals met: 5 of 8
24. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 56 to 59
   goals met: 5 of 8
25. (place scroll3 hamletc rightstrap1 courier1)
   deleted: (held-in scroll3 rightstrap1)
   added: (idle rightstrap1) (resting scroll3 hamletc)
   changed: (current_pouch courier1) from 2 to 0, (toll) from 59 to 61
   goals met: 6 of 8
26. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 61 to 64
   goals met: 6 of 8
27. (place scroll6 hamletb rightstrap2 courier2)
   deleted: (held-in scroll6 rightstrap2)
   added: (idle rightstrap2) (resting scroll6 hamletb)
   changed: (current_pouch courier2) from 2 to 1, (toll) from 64 to 66
   goals met: 7 of 8
28. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 66 to 69
   goals met: 7 of 8
29. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 69 to 72
   goals met: 7 of 8
30. (place scroll2 hamletc leftstrap2 courier2)
   deleted: (held-in scroll2 leftstrap2)
   added: (idle leftstrap2) (resting scroll2 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 72 to 74
   goals met: 8 of 8
